Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Clicking the “Add a category” button will bring up a modal window where you can find and select additional categories:
ja: 「カテゴリーを追加」ボタンをクリックすると、すでに追加されているカテゴリの検索や選択ができるモーダルウィンドウが表示されます。

source: Clicking the “Add a user button will bring up a modal window where you can find and select additional users:
ja: 「ユーザーを追加」ボタンをクリックすると、すでに追加されているユーザーの検索や選択ができるモーダルウィンドウが表示されます。

source: Clicking the “Add an asset” button will bring up a modal window where you can find and select additional assets, as well as upload new ones:
ja: 「アセットを追加」ボタンをクリックすると、新しいアセットのアップロードはもちろん、すでに追加されているアセットの検索や選択ができるモーダルウィンドウが表示されます。

source: Clicking the “Add an entry” button will bring up a modal window where you can find and select additional entries:
ja: 「エントリを追加」ボタンをクリックすると、すでに追加されているエントリの検索や選択ができるモーダルウィンドウが表示されます。

source: Clicking “Make required” will add an asterisk (*) beside the field’s name, indicating that it’s now required.
ja: 「必須にする」をクリックすると、フィールド名の横にアスタリスク（*）が追加され、必須項目になったことを示します。

source: Clones a given object.
ja: 指定されたオブジェクトのクローンを作成します。

source: Cloning Element Queries
ja: エレメントクエリの複製

source: Code Style
ja: コードスタイル

source: Code of Conduct
ja: 行動規範

source: Coding Guidelines
ja: コーディングガイドライン

source: Color Fields
ja: 色フィールド

source: Color fields give you a hexadecimal color input with a preview of the current color, and on browsers that support <input type="color">, clicking on the preview will open the browser’s color picker.
ja: 色フィールドでは、現在のカラーのプレビューが付いた16進数のカラー入力を提供します。<input type="color"> をサポートしているブラウザでは、プレビューのクリックでブラウザのカラーピッカーを開きます。

source: Color
ja: 色

source: Column Heading – The name that will appear in the head of the table
ja: 列の見出し – テーブルのヘッダに表示する名前

source: Comment Tags
ja: コメントタグ

source: Common Examples
ja: 一般的な実例

source: Composer will take a couple minutes to load everything.
ja: Composer がすべてをロードするのに、数分かかるでしょう。

source: Composer will take a few minutes to install everything.
ja: Composer はすべてをインストールするのに数分かかるでしょう。

source: Composer’s installation log should indicate that the package was installed via a symlink:
ja: Composer のインストールログは、シンボリックリンク経由でパッケージがインストールされたことを表示するでしょう。

source: Conditionals are also fair game.
ja: 条件文もまた、かっこうの標的です。

source: Conditions that span multiple lines should have logical operators (||, &&, etc.) at the end of lines.
ja: 複数行にまたがる条件文には、行の最後に理論演算子（||、&& など）を付ける必要があります。

source: Config Settings
ja: コンフィグ設定

source: Configuration
ja: コンフィギュレーション

source: Configuration – This is where you configure which block types should be available to your Matrix field, and which sub-fields each of those block types should have.
ja: 構成 – ここでは、行列フィールドでどのようなブロックタイプが利用可能か、それらのブロックタイプがどのようなサブフィールドを持つ必要があるかを設定します。

source: Configure the .env file in your new project with your database connection settings from your old craft/config/db.php file.
ja: 古い craft/config/db.php から新しいプロジェクトの .env ファイルにデータベース接続設定を定義します。

source: Configure your .env file with your database connection settings.
ja: .env ファイルにデータベース接続設定を定義します。

source: Configure your web server so the domain (e.g. beta.craftcms.com) points at the web directory.
ja: ドメイン（例： beta.craftcms.com）が web ディレクトリを参照するよう、ウェブサーバーを設定します。

source: Congratulations, you’ve just installed Craft!
ja: おめでとうございます！Craft がインストールされました。

source: Considering the amount of damage an admin can do, it’s strongly recommended that you be conservative with creating new admin accounts.
ja: 管理者が行うことができるダメージの量を考えると、新しい管理者アカウントの作成は慎重に行うことを強くお勧めします。

source: Content Migrations
ja: コンテンツマイグレーション

source: Content migrations are migrations that are written and managed for your Craft project, rather than for Craft the application, or for a plugin.
ja: コンテンツマイグレーションとは、Craft 本体のアプリケーションやプラグインではなく、Craft プロジェクトのために書かれたり管理されているものに対してのマイグレーションです。

source: Continued Reading
ja: 続きを読む

source: Control Panel Section
ja: コントロールパネル用セクション

source: Controller Action
ja: コントローラーアクション

source: Controller action routes should be defined as a string ('action/path') rather than an array with an action key (['action' => 'action/path']).
ja: コントローラーアクションのルーティングは、action キーを持つ配列（['action' => 'action/path']）ではなく、文字列（'action/path'）として定義する必要があります。

source: Copy any other files in your old public/ directory into your new project’s web/ directory.
ja: 古い public/ ディレクトリに含まれるすべてのファイルを新しいプロジェクトの web/ ディレクトリにコピーします。

source: Copy any settings from your old craft/config/general.php file into your new project’s config/general.php file.
ja: 古い craft/config/general.php ファイルのすべての設定を新しいプロジェクトの config/general.php ファイルにコピーします。

source: Copy your old craft/config/license.key file into your new project’s config/ folder.
ja: 古い craft/config/license.key ファイルを新しいプロジェクトの config/ フォルダにコピーします。

source: Copy your old custom Redactor config files from craft/config/redactor/ over to your new project’s config/redactor/ directory.
ja: 古いカスタムの Redactor 設定ファイルを craft/config/redactor/ から新しいプロジェクトの config/redactor/ ディレクトリにコピーします。

source: Copy your old custom login page logo and site icon files from craft/storage/rebrand/ over to your new project’s storage/rebrand/ directory.
ja: 古いカスタムのログインページのロゴやサイトアイコンファイルを craft/storage/rebrand/ から新しいプロジェクトの storage/rebrand/ ディレクトリにコピーします。

source: Copy your old templates from craft/templates/ over to your new project’s templates/ directory.
ja: 古いテンプレートを craft/templates/ から新しいプロジェクトの templates/ ディレクトリにコピーします。

source: Copy your old user photos from craft/storage/userphotos/ over to your new project’s storage/userphotos/ directory.
ja: 古いユーザーフォトを craft/storage/userphotos/ から新しいプロジェクトの storage/userphotos/ ディレクトリにコピーします。

source: Core Concepts
ja: コアコンセプト

source: Core element types have the following reference handles:
ja: コアのエレメントタイプは、次のリファレンスハンドルを持っています。

source: Craft 3 Documentation
ja: Craft 3 ドキュメント

source: Craft 3 adds a $includeAuditColumns argument to the , , and migration methods (set to true by default) that determines whether to insert/update data in the “audit” columns (dateCreated, dateUpdated, uid).
ja: Craft 3 は「audit」カラムのデータ（dateCreated、dateUpdated、 uid）を挿入 / 更新するかどうかを決定する$includeAuditColumns 引数（デフォルトは trueに設定されています）を 、、および のマイグレーションメソッドに追加します。

source: Craft 3 is available as a package.
ja: Craft 3 は パッケージとして利用できます。

source: Craft 3 still supports static translations, but the directory structure has changed.
ja: Craft 3 でも静的な翻訳をサポートしていますが、ディレクトリ構成が変わりました。

source: Craft 3 supports both MySQL 5.5+ and PostgreSQL 9.5+.
ja: Craft 3 は MySQL 5.5 以上と PostgreSQL 9.5 以上の両方をサポートします。

source: Craft 3 uses Twig 2, which has its own breaking changes for templates:
ja: Craft 3 では、テンプレート向けに独自の変更を加えた Twig 2 を使用しています。

source: Craft 3 will only use it because there is not a PHP 7 compatible version of memcache available.
ja: Craft 3 では、利用可能な memcache の PHP 7 互換バージョンがないため、それを使用します。

source: Craft Installation Complete
ja: Craft インストール画面（完了）

source: Craft Installation Create User Account
ja: Craft インストール画面（ユーザーアカウントの作成）

source: Craft Installation Database Connection Information
ja: Craft インストール画面（データベース接続情報）

source: Craft Installation License Agreement
ja: Craft インストール画面（ライセンス契約の確認）

source: Craft Installation Screen
ja: Craft のインストール画面

source: Craft Installation System Settings
ja: Craft インストール画面（システム設定）

source: Craft Pro allows you to set permissions on users and groups, such as the ability to access the control panel, edit content within certain sections, etc.
ja: Craft Pro では、コントロールパネルにアクセスしたり、特定セクションのコンテンツを編集するといった権限をユーザーやグループに許可できます。

source: Craft Pro has the option of allowing public user registration, which is disabled by default.
ja: Craft Pro には、一般ユーザーの登録を許可するオプションがあり、デフォルトで無効化されています。

source: Craft Setup from the Command Line
ja: コマンドラインからの Craft のセットアップ

source: Craft calls all member accounts of the system “users”.
ja: Craft はシステムのすべてのメンバーアカウントを「ユーザー」と呼びます。

source: Craft can be downloaded with Composer or by manually downloading a zip or tar.gz archive.
ja: Craft は Composer でダウンロードするか、zip または tar.gz アーカイブを手動でダウンロードできます。

source: Craft comes with five relational field types:
ja: Craft は次の5つの関連フィールドタイプがあります。

source: Craft comes with the following built-in field types:
ja: Craft は次の組み込みのフィールドタイプがあります。

source: Craft creates the first Site Group for you – named after the default site – and assigns the default site to that group.
ja: Craft は（デフォルトサイトの名前を付けた）最初のサイトグループを作成し、そのグループにデフォルトサイトを割り当てます。

source: Craft creates the first user account during installation.
ja: Craft はインストール中に最初のユーザーアカウントを作成します。

source: Craft does its best to keep its search indexes as up-to-date as possible, but there are a couple things that might render portions of them inaccurate.
ja: Craft は検索インデックスを可能な限り最新に保つよう、最善を尽くしています。しかし、その一部を不正確にするかもしれない可能性がいくつかあります。

source: Craft has a powerful engine for relating elements to one another.
ja: Craft は、エレメントを互いに関連付けるための強力なエンジンを持っています。

source: Craft has a standard template path format that applies to each of these cases: a Unix-style file system path to the template file, relative from your craft/templates directory.
ja: Craft には、これらのケース（ craft/templates ディレクトリからそのテンプレートファイルまでの相対的な Unix スタイルのファイルシステムのパス）それぞれに当てはまる、標準的なテンプレートパスのフォーマットがあります。

source: Craft has system Controller actions for core actions, but plugins may also have Controllers that define their own custom actions.
ja: Craft にはコアアクションのためのシステムコントローラーアクションがありますが、プラグインが同様に独自のカスタムアクションを定義したコントローラーを持っている場合があります。

source: Craft has three different types of sections:
ja: Craft には3つの異なるタイプのセクションがあります。

source: Craft hides from direct access any template path segments that begin with an underscore.
ja: Craft はアンダースコアではじまるテンプレートパスのセグメントに直接アクセスすることから隠します。

source: Craft is a content-first CMS that aims to make life enjoyable for developers and content managers alike.
ja: Craft は開発者とコンテンツ管理者がお互いに楽しい生活を送れることを目的とする、コンテンツファーストな CMS（コンテンツ管理システム）です。

source: Craft is a self-hosted PHP application built on Yii.
ja: Craft は Yii をベースとするセルフホスティングの PHP アプリケーションです。

source: Craft is agnostic to your website's layout.
ja: Craft は、あなたのウェブサイトのレイアウトに無関心です。

source: Craft makes the matched element available to the template via a pre-populated entry or category variable.
ja: Craft はあらかじめ用意された変数 entry や category を経由して、マッチしたエレメントをテンプレートで利用可能にします。

source: Craft organizes Globals into Global Sets.
ja: Craft はグローバル設定内でグローバルを整理します。

source: Craft pre-fills all three based on other settings but you can edit each field before clicking "Finish up".
ja: Craft は他の設定に基づいて3つの項目をあらかじめ埋めますが、「Finish up（完了）」ボタンをクリックする前にそれぞれのフィールドを編集できます。

source: Craft provides a way to perform a large variety of image transformations to your assets.
ja: Craft はアセットに多種多様な画像変形を行う手段を提供します。

source: Craft provides some fields automatically (Title, Slug, Post Date, and more) but we can also define our own fields so we can mold Craft around our content.
ja: Craft はいくつかのフィールド（タイトル、スラグ、投稿日など）を自動的に提供しますが、独自フィールドを定義してコンテンツに即した Craft を形作ることもできます。

source: Craft requires the following PHP extensions:
ja: Craft は次の PHP エクステンションが必要です。

source: Craft requires the following:
ja: Craft は次の項目が必要です。

source: Craft routes action requests to a controller action that perform actions.
ja: Craft は、アクションを実行するコントローラーアクションに、アクションリクエストをルーティングします。

source: Craft sets the default site as the Primary site, meaning Craft will load it by default on the front end, if it is unable to determine which site to load.
ja: Craft はデフォルトサイトをプライマリサイトとしてセットします。すなわち、どのサイトをロードするか決定できない場合に Craft がフロントエンドのデフォルトとしてロードします。

source: Craft supports a custom syntax for routing requests to a template, rather than a controller action:
ja: Craft はコントローラーアクションではなく、テンプレートをリクエストするルーティング向けに、独自の構文をサポートしています。

source: Craft supports several database configuration settings.
ja: Craft は、いくつかのデータベース設定をサポートしています。

source: Craft supports several general configuration settings.
ja: Craft は、いくつかの一般設定をサポートしています。

source: Craft supports the following search syntax:
ja: Craft は次の検索構文をサポートしています。

source: Craft treats templates with names prefixed with an underscore, for example recipes/_entry.html, as hidden templates that are not directly accessible.
ja: Craft は、recipes/_entry.html のように、名前の接頭辞にアンダースコアが付いたテンプレートを直接アクセスできない不可視テンプレートとして扱います。

source: Craft uses Guzzle 6 whenever creating HTTP requests, such as:
ja: Craft は、次のような HTTP リクエストを作成するたびに Guzzle 6 を使用します。

source: Craft uses Twig to parse your templates.
ja: Craft はテンプレートを解析するために Twig を利用します。

source: Craft uses the Twig templating engine to make it really easy for you to bring the website templates to life using the data you’ve saved in Craft.
ja: Craft は保存されたデータをウェブサイトのテンプレートで使いやすくするために Twig テンプレートエンジンを利用しています。

source: Craft uses the site name in the Control Panel and you can also display it in your templates using {{ siteName }}.
ja: Craft はコントロールパネルのサイト名を利用し、{{ siteName }} を使ってテンプレート内に表示することもできます。

source: Craft will allow you to update this field's content in each entry on a per-language basis.
ja: Craft は、それぞれのエントリにあるこのフィールドのコンテンツを言語単位で更新することを許可します。

source: Craft will automatically detect which site the browser is requesting.
ja: Craft はブラウザがどのサイトを要求しているかを自動的に検出します。

source: Craft will automatically serve the correct site by inspecting the requested URL, unless this is set.)
ja: セットされていなければ、Craft はリクエスト URL を調査することで正しいサイトを自動的に配信します。）

source: Craft will automatically toggle the current Primary site.
ja: Craft は現在のプライマリサイトを自動的に切り替えます。

source: Craft will check this file to get basic information about the plugin.
ja: Craft はプラグインに関する基本情報を取得するために、このファイルをチェックします。

source: Craft will fallback on its own template corresponding to the status code.
ja: Craft はそのステータスコードに対応する独自のテンプレートをフォールバックします。

source: Craft will look for localized templates before it looks for templates in the normal location, so you can use them to override non-localized templates.
ja: Craft は、通常のテンプレートを探す前にローカライズ用のテンプレートを探します。それによって、ローカライズされていないテンプレートを上書きすることができます。

source: Craft’s global variables are available to these templates as well:
ja: Craft のグローバル変数は、これらのテンプレートでも利用できます。

source: Craft’s Composer support has two parts:
ja: Craft の Composer サポートは2つのパートでできています。

source: Craft’s Control Panel requires a modern browser:
ja: Craft のコントロールパネルは、モダンブラウザが必要です。

source: Craft’s custom filters
ja: Craft の独自フィルタ

source: Craft’s custom functions
ja: Craft の独自ファンクション

source: Craft’s custom tags
ja: Craft の独自タグ

source: Craft’s extended DateTime class has been removed in Craft 3.
ja: Craft によって拡張された DateTime クラスは Craft 3 で削除されました。

source: Craft’s job queue is powered by the Yii2 Queue Extension.
ja: Craft のジョブキューは Yii2 Queue Extension によって動いています。

source: Craft’s plugin architecture provides a solid foundation for building just about anything.
ja: Craft のプラグインアーキテクチャは、何かを構築するための強固な基盤を提供します。

source: Craft’s translation messages
ja: Craft 向けの翻訳メッセージ

source: Create a New Craft Project
ja: 新しい Craft プロジェクトの作成

source: Create a new web server to host your Craft project.
ja: Craft プロジェクトをホストするための新しいウェブサーバーを用意してください。

source: Create new subfolders (right-click on folder name)
ja: （フォルダ名を右クリックして）新しいサブフォルダの作成

source: Create the template directories and templates for your new site.
ja: 新しいサイト向けに、テンプレートディレクトリとテンプレートを作成します。

source: Creating Element Queries
ja: エレメントクエリの作成

source: Creating Migrations
ja: マイグレーションの作成

source: Creating Routes
ja: ルートの作成

source: Creating a New Route
ja: 新しいルートの作成画面

source: Creating a Site
ja: サイトの作成

source: Creating and Editing Categories
ja: カテゴリの作成と編集

source: Credits for the sources and inspiration of this code of conduct go to the [Django Project](https://www.djangoproject.com/conduct/) and many others.
ja: この行動規範のソース、および、インスピレーションのクレジットは [Django Project](https://www.djangoproject.com/conduct/) をはじめとする沢山のものに行き着きます。

source: Crop – Crops the image to the specified width and height, scaling the image up if necessary.
ja: 切り抜き – 指定された幅と高さに画像を切り抜き、必要であれば画像を拡大します。

source: Currency Formatting
ja: 通貨フォーマット

source: Custom Field Parameters
ja: カスタムフィールドのパラメータ

source: Custom field handles are also supported, for field types with values that can be represented as strings.
ja: カスタムフィールドのハンドルもサポートされています。フィールドタイプは文字列として表すことができる値を持っています。

source: DOM - Required for parsing XML feeds as well as .
ja: DOM - と同様に XML フィードの解析に必要です。

source: DOM - Required for parsing XML feeds as well as yii\web\XmlResponseFormatter.
ja: DOM - yii\web\XmlResponseFormatter と同様に、XML フィードを解析するために必要です。

source: Data Caching Config
ja: データキャッシュ設定

source: Database Config
ja: データベース設定

source: Date Formatting
ja: 日付フォーマット

source: Date fields give you a date picker, and optionally a time picker as well.
ja: 日付フィールドは date picker を提供します。同様に、オプションで time picker を提供します。

source: Date/Time Fields
ja: 日/時フィールド

source: Date/Time fields let you choose whether you want to show the date, the time, or both.
ja: 日/時フィールドは、日付、時間、もしくはその両方にするか、お好みで選択できます。

source: Date/Time fields show either a date picker, a time picker, or both, depending on the settings.
ja: 日/時フィールドでは、設定に応じて date picker、time picker、または両方が表示されます。

source: Date/Time
ja: 日/時

source: Dates and times are both formatted for the user’s preferred locale.
ja: 日付と時刻は、いずれもユーザーが優先するロケールに応じてフォーマットされます。

source: Decimal Points – The maximum number of decimal points that may be entered in the field
ja: 小数点 – フィールドに入力できる小数点以下の最大の桁数

source: Declare method argument types whenever possible.
ja: 可能な限り、メソッド引数の型を宣言してください。

source: Default Character Set: utf8
ja: デフォルトの文字セット： utf8

source: Default Collation: utf8_unicode_ci
ja: デフォルトの照合順： utf8_unicode_ci

source: Default Upload Location – The default location that files dragged directly onto the field should be saved in
ja: 既定のアップロードロケーション – フィールドに直接ドラッグされたファイルを保存するデフォルトのロケーション

source: Default Values – Define the default row and column values for new instances of the field.
ja: デフォルトの変数 – フィールドの新しいインスタンスを作成したときにセットされる行および列のデフォルト値を定義します。

source: Define the Entry URI Format, Template, and Status for the new site in each Section.
ja: 各セクションの新しいサイト向けに、エントリー URI 形式、テンプレート、およびデフォルトのステータスを定義します。

source: Defining Custom Parameters on Eager-Loaded Elements
ja: Eager-Loaded エレメントのカスタムパラメータを定義する

source: Defining Transforms from the Control Panel
ja: コントロールパネルからトランスフォームの定義

source: Defining Transforms in your Templates
ja: テンプレート内でトランスフォームを定義する

source: Delete files
ja: ファイルの削除

source: Delete subfolders
ja: サブフォルダの削除

source: Delete users
ja: ユーザーを削除する

source: Delete your old craft/app/ directory.
ja: 古い craft/app/ ディレクトリを削除してください。

source: Description
ja: 説明

source: Developer Name with your name, or the organization name that the plugin should be attributed to.
ja: Developer Name をあたなの名前、または、プラグインが帰属する組織名にします。

source: Different people have different perspectives on issues.
ja: 異なる人々は問題に対し異なる展望を持っています。

source: Directory Structure
ja: ディレクトリ構造

source: Discriminatory jokes and language.
ja: 差別的な冗談や言葉づかい。

source: Disqus has certain configuration variables that you can use to ensure comments end up on the right post.
ja: Disqus には意図したポストへのコメントを保証するために使うことができる、規定のコンフィグ変数があります。

source: Diversity is one of our strengths.
ja: 多様性はわたしたちの強みの1つです。

source: Do not insult or put down other participants.
ja: 他の参加者を侮辱したり、こきおろしたりしないでください。

source: Do your best to follow these guidelines when writing code for Craft and Craft plugins.
ja: Craft や Craft プラグイン向けのコードを書くときには、このガイドラインに従うよう最善を尽くしてください。

source: Documentation
ja: ドキュメント

source: Does the URI match a template?
ja: URI がテンプレートとマッチするか？

source: Does the URI match any Dynamic Routes?
ja: URI が動的なルートとマッチするか？

source: Don’t be one of those people and be sure to pick a strong password.
ja: 特別なアカウント として、強力なパスワードを選んでください。

source: Don’t forget that it is human to err and blaming each other doesn’t get us anywhere.
ja: 誤ることが人間的であることを忘れないでください。そして、お互いに非難してもわたしたちのためになりません。

source: Don’t forget to keep it updated though!
ja: そして、アップデートし続けることを忘れないでください！

source: Don’t fret too much over line lengths.
ja: 行の長さにあまり思い悩まないでください。

source: Don’t put a space after type typecasts ((int)$foo).
ja: 型変換の後にスペースを置かないでください（(int)$foo）。

source: Don’t use them to cache static text; that will be more expensive than simply outputting the text.
ja: 静的なテキストにキャッシュを使用しないでください。シンプルにテキストを出力するよりも、コストが高くなります。

source: Don’t wrap include/include_once/require/require_once file paths in parentheses.
ja: include / include_once / require / require_once のファイルパスを括弧で囲まないでください。

source: Double-clicking on a category will bring up a modal that lets you edit its name, slug, and any fields you’ve assigned to the group.
ja: カテゴリをダブルクリックすると、カテゴリの名前やスラグ、およびグループに関連付けられたすべてのフィールドを編集できるモーダルウィンドウが開きます。

source: Double-clicking on a selected asset will open a modal where you can edit the file’s title and any fields you have associated with your assets from Settings → Assets → Fields.
ja: 選択されたアセットをダブルクリックすると、ファイルのタイトルや「設定 > アセット > フィールド」でアセットに関連付けられたフィールドを編集できるモーダルウィンドウが開きます。

source: Double-clicking on a selected entry will open a modal where you can edit the entry’s title and custom fields.
ja: 選択されたエントリをダブルクリックすると、エントリのタイトルやカスタムフィールドを編集できるモーダルウィンドウが開きます。

source: Double-clicking on a selected tag will open a modal where you can edit the tag’s title, and any fields you have associated with your tags from Settings → Tags → Fields.
ja: 選択されたタグをダブルクリックすると、タグのタイトルや「設定 > タグ > フィールド」でタグに関連付けられたフィールドを編集できるモーダルウィンドウが開きます。

source: Download the archive format you prefer to work with:
ja: 作業に適したアーカイブ形式をダウンロードします。

source: Downloading an Archive File Manually
ja: アーカイブファイルを手動でダウンロード

source: Downloading with Composer
ja: Composer でダウンロード

source: Drink Recipe Entry: Source
ja: ドリンクレシピエントリ：ソース

source: Dropdown Fields
ja: セレクトボックスフィールド

source: Dropdown Options – Define the options that will be available in the field.
ja: セレクトボックスのオプション – フィールドで利用可能なオプションを定義します。

source: Dropdown fields give you a dropdown input.
ja: セレクトボックスフィールドは、ドロップダウン形式の入力を提供します。

source: Dropdown fields have the following settings:
ja: セレクトボックスフィールドの設定は、次の通りです。

source: Dropdown fields will show a dropdown input with each of the Dropdown Options as defined in the field settings:
ja: セレクトボックスフィールドでは、フィールド設定で定義されたセレクトボックスのオプションがドロップダウン形式で表示されます。

source: Dropdown
ja: セレクトボックス

source: During development, the easiest way to work on your plugin is with a , which will tell Composer to symlink your plugin into the vendor/ folder right alongside other dependencies.
ja: 開発中にプラグインを動作させる最も簡単な方法は、他の依存関係と同様に vendor/ フォルダへシンボリックリンクするよう Composer に伝える を利用することです。

source: Dynamic Entry Titles
ja: 動的なエントリタイトル

source: Dynamic Routes
ja: 動的なルート

source: Dynamic Subfolder Paths
ja: 動的なサブフォルダパス

source: Each Categories field is connected to a single category group.
ja: それぞれのカテゴリフィールドは、1つのカテゴリグループに接続されています。

source: Each Category Group lets you define the following:
ja: それぞれのカテゴリグループには、次のことを定義できます。

source: Each Category Groups can have its own Field Layout, which allows you to customize the data that is associated with each category in the group.
ja: それぞれのカテゴリグループは、グループ内のカテゴリに関連付けられたデータをカスタマイズできる独自のフィールドレイアウトを持っています。

source: Each Craft project should have a unique security key, which is shared between each of the environments that the project in installed on.
ja: それぞれの Craft プロジェクトでは、そのプロジェクトがインストールされている各環境で共有されるユニークなセキュリティキーが必要です。

source: Each Global Set has its own field layout using any of the existing fields or new fields.
ja: それぞれのグローバル設定は、存在するすべてのフィールドや新しいフィールドを利用する独自のフィールドレイアウトを持ちます。

source: Each Tags field is connected to a single tag group.
ja: それぞれのタグフィールドは、1つのタググループに接続されています。

source: Each block has a settings menu that reveals additional things you can do with the block.
ja: 各ブロックは設定メニューを持ち、そのブロックに対して追加でできることを開示します。

source: Each column has the following properties:
ja: それぞれの列には、次のプロパティがあります。

source: Each content tab will get its own gear icon allowing you to rename or delete it.
ja: 各コンテンツタブには歯車アイコンが表示され、リネームや削除ができます。

source: Each entry can only belong to one Section.
ja: それぞれのエントリは、1つのセクションにしか属することができません。
